In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

import missingno as mns

import warnings
warnings.filterwarnings('ignore')

In [2]:
state_data = pd.read_csv('./Data/covid19indiaorg/states.csv')
state_data.head()

         Date   State  Confirmed  Recovered  Deceased  Other  Tested
0  2020-01-30  Kerala          1          0         0      0     NaN
1  2020-01-30   India          1          0         0      0     NaN
2  2020-02-02  Kerala          2          0         0      0     NaN
3  2020-02-02   India          2          0         0      0     NaN
4  2020-02-03  Kerala          3          0         0      0     NaN

In [3]:
st_copy = state_data.copy()
st_copy.head()

         Date   State  Confirmed  Recovered  Deceased  Other  Tested
0  2020-01-30  Kerala          1          0         0      0     NaN
1  2020-01-30   India          1          0         0      0     NaN
2  2020-02-02  Kerala          2          0         0      0     NaN
3  2020-02-02   India          2          0         0      0     NaN
4  2020-02-03  Kerala          3          0         0      0     NaN

In [4]:
st_copy.shape

(10491, 7)

In [5]:
st_copy.tail()

,Date,State,Confirmed,Recovered,Deceased,Other,Tested
10486,2021-01-01,Tripura,33261,32728,382,23,580269.0
10487,2021-01-01,India,10286790,9882403,149021,2857,172049574.0
10488,2021-01-01,Uttar Pradesh,584966,562459,8352,0,23943169.0
10489,2021-01-01,Uttarakhand,90920,83506,1509,1186,1777371.0
10490,2021-01-01,West Bengal,552063,530366,9712,0,7110430.0

In [6]:
df_india = st_copy[(st_copy['State'] == 'India')]
df_india.head()

          Date  State  Confirmed  Recovered  Deceased  Other  Tested
1   2020-01-30  India          1          0         0      0     NaN
3   2020-02-02  India          2          0         0      0     NaN
5   2020-02-03  India          3          0         0      0     NaN
7   2020-02-14  India          3          3         0      0     NaN
10  2020-02-20  India          3          3         0      0     NaN

In [7]:
df_india.shape

(311, 7)

In [8]:
df_india.tail()

             Date  State  Confirmed  Recovered  Deceased  Other       Tested
10343  2020-12-28  India   10224797    9806767    148190   2823  169802049.0
10379  2020-12-29  India   10245339    9833356    148475   2834  170922330.0
10415  2020-12-30  India   10267284    9859763    148774   2849  172049574.0
10451  2020-12-31  India   10286329    9881786    149018   2857  172049574.0
10487  2021-01-01  India   10286790    9882403    149021   2857  172049574.0